Autodesk.Revit.DB.Structure.RebarShapeSegment.SetConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this segment.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with RebarShapeDefinition.AddParameter().
The allowable constraint types are:
RebarShapeConstraintAngleFromFixedDirRebarShapeConstraintSegmentLengthRebarShapeConstraintFixedSegmentDirRebarShapeConstraintProjectedSegmentLengthRebarShapeConstraint180DegreeBendArcLengthRebarShapeConstraint180DegreeBendRadiusRebarShapeConstraint180DegreeDefaultBend
At least two independent constraints must be specified. Overconstraining
is supported. Constraints of type RebarShapeConstraintFixedSegmentDir must be unique.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for RebarShapeSegment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012